Repository: MykhailoZaichenko/gym_tracker_app
Catalog: lib/l10n/intl_*.arb
Languages: uk

source: OK
uk: ОК

source: Cancel
uk: Скасувати

source: Save
uk: Зберегти

source: Saved
uk: Збережено

source: Close
uk: Закрити

source: Discard
uk: Не зберігати

source: Edit
uk: Редагувати

source: Delete
uk: Видалити

source: Yes
uk: Так

source: No
uk: Ні

source: Send
uk: Надіслати

source: Guest
uk: Гість

source: Get Started
uk: Почати

# continueAction
source: Continue
uk: Продовжити

# onboardingTitle
source: Enter your weight for personalization
uk: Вкажіть вашу вагу для персоналізації

# loginTitle
source: Log in to your account
uk: Ввійти в обліковий запис

# registerTitle
source: Create an account
uk: Створити обліковий запис

# registerAction
source: Register
uk: Зареєструватися

# loginAction
source: Log In
uk: Ввійти

source: Forgot password
uk: Забули пароль

source: Already have account?
uk: Вже є акаунт?

# verifyEmailTitle
source: Verify Email
uk: Підтвердження пошти

# verifyEmailMessage
source: A verification email has been sent to your email address. Please follow the link in the email.
uk: Лист із підтвердженням було надіслано на вашу електронну пошту. Будь ласка, перейдіть за посиланням у листі.

source: Resend Email
uk: Надіслати лист ще раз

source: Cancel (Logout)
uk: Скасувати (Вийти)

# resetPasswordTitle
source: Reset Password
uk: Скидання паролю

# resetPasswordInstruction
source: Enter your email. We will send you a link to reset your password.
uk: Введіть свій email. Ми надішлемо вам посилання для створення нового паролю.

# resetPasswordEmailSent
source: Password reset email sent! Check your inbox.
uk: Лист для скидання паролю надіслано! Перевірте пошту.

# emailHint
source: Enter email
uk: Введіть email

# passwordLabel
source: Password
uk: Пароль

# passwordHint
source: Enter password
uk: Введіть пароль

# confirmPasswordLabel
source: Confirm Password
uk: Підтвердження паролю

# confirmPasswordHint
source: Enter password again
uk: Введіть пароль ще раз

# nameLabel
source: Name
uk: Імʼя

# nameHint
source: Enter name
uk: Введіть імʼя

# weightLabel
source: Weight
uk: Вага

# repsLabel
source: Reps
uk: Повт

# errEmailRequired
source: Email required
uk: Email обовʼязковий

# errInvalidEmail
source: Invalid email
uk: Невірний email

# errPasswordRequired
source: Password required
uk: Пароль обовʼязковий

# errPasswordShort
source: Password must be at least 6 chars
uk: Пароль має бути мінімум 6 символів

# errPasswordsDoNotMatch
source: Passwords do not match
uk: Паролі не співпадають

# errNameRequired
source: Name required
uk: Імʼя обовʼязкове

# errNameShort
source: Name too short
uk: Занадто коротке імʼя

# errWeightRequired
source: Enter correct weight
uk: Введіть коректну вагу

# errWeightInvalid
source: Weight must be a number > 0
uk: Вага повинна бути числом > 0

# errGoogleSignIn
source: Google Sign-In error
uk: Помилка входу через Google

# errInvalidCredentials
source: Invalid email or password
uk: Невірний email або пароль

# errLoginGeneral
source: Login error
uk: Помилка входу

# errUserNotFound
source: User with this email not found
uk: Користувача з такою поштою не знайдено

# errWrongPassword
source: Wrong password
uk: Невірний пароль

# errEmailAlreadyInUse
source: The email address is already in use
uk: Цей email вже використовується іншим акаунтом

# errWeakPassword
source: Password is too weak
uk: Пароль занадто слабкий

# errTooManyRequests
source: Too many requests. Try again later
uk: Забагато спроб. Спробуйте пізніше

# errRequiresRecentLogin
source: This action requires you to log in again
uk: Для цієї дії потрібно зайти в акаунт заново

# errUnknown
source: An unknown error occurred
uk: Сталася невідома помилка

# saveError
source: Error saving: {error}
uk: Помилка збереження: {error}

# navHome
source: Home
uk: Головна

# navJournal
source: Journal
uk: Щоденник

# navHistory
source: History
uk: Історія

# navStats
source: Statistics
uk: Статистика

# navProfile
source: Profile
uk: Профіль

# calendarTitle
source: Workout Calendar
uk: Календар тренувань

# selectDay
source: Select a day
uk: Оберіть день

source: Select month
uk: Оберіть місяць

# pickMonthYear
source: Pick month and year
uk: Виберіть місяць і рік

# prevYear
source: Previous year
uk: Попередній рік

source: Next year
uk: Наступний рік

# backToToday
source: Latest
uk: Сьогодні

source: Exercises for
uk: Вправи за

# noExercisesToday
source: No exercises for this day
uk: Немає вправ за цей день

# workoutTitle
source: Workout
uk: Тренування

source: Start Workout
uk: Почати тренування

source: Continue Workout
uk: Продовжити тренування

# workoutToday
source: Workout for Today
uk: Тренування на сьогодні

# noWorkoutToday
source: No workout logged for today
uk: На сьогодні немає записів

# saveChangesTitle
source: Save changes?
uk: Зберегти зміни?

# unsavedChangesMsg
source: You have unsaved changes. Save before exit?
uk: Є незбережені зміни. Зберегти перед виходом?

source: Synchronized
uk: Синхронізовано

# selectWorkoutType
source: Select the type of training
uk: Оберіть тип тренування

# splitPush
source: Push
uk: Push (Жим)

# splitPull
source: Pull
uk: Pull (Тяга)

# splitLegs
source: Legs
uk: Ноги

# splitUpper
source: Upper Body
uk: Верх тіла

# splitLower
source: Lower Body
uk: Низ тіла

# splitFullBody
source: Full Body
uk: Все тіло

# splitCardio
source: Cardio
uk: Кардіо

# splitCustom
source: Custom
uk: Інше

# copyPreviousWorkout
source: Copy previous {type} workout
uk: Скопіювати минуле тренування {type}

# addExerciseBtn
source: Add Exercise
uk: Додати вправу

# addSetBtn
source: Add Set
uk: Додати підхід

# setsLabel
source: Sets
uk: Підходів

# weightRepsLabel
source: Weight (kg·reps)
uk: Вага (kg·reps)

# setLabelCompact
source: Set
uk: Підх

source: Set {number}
uk: Підхід {number}

# deleteSet
source: Delete set {number}
uk: Видалити підхід {number}

# setsCount
source: {count, plural, one{1 set} other{{count} sets}}
uk: {count, plural, one{1 підхід} few{{count} підходи} many{{count} підходів} other{{count} підходів}}

# exercisesCount
source: {count, plural, one{1 exercise} other{{count} exercises}}
uk: {count, plural, one{1 вправа} few{{count} вправи} many{{count} вправ} other{{count} вправ}}

# weightUnit
source: kg
uk: кг

# weightUnitHint
source: Kg
uk: Кг

# repsUnit
source: reps
uk: повт

# repsUnitHint
source: Reps
uk: Повт

source: Calories
uk: Калорії

# caloriesCount
source: {count} kcal
uk: {count} ккал

# exerciseDefaultName
source: Exercise
uk: Вправа

source: Enter custom exercise name
uk: Введіть назву вправи

# exerciseNameHint
source: Exercise name
uk: Назва вправи

source: Add exercise
uk: Додати вправу

# addExercisesHint
source: Add exercises in calendar to see the graph
uk: Додайте вправи у календарі, щоб бачити графік

source: Select exercise
uk: Оберіть вправу

source: Delete exercise
uk: Видалити вправу

source: Search exercise
uk: Пошук вправи

source: Enter custom name
uk: Ввести власну назву

# addExerciseTooltip
source: Add exercise
uk: Додати вправу

# editExercisesTooltip
source: Edit exercises
uk: Редагувати вправи

# chartsTitle
source: Progress — Charts
uk: Прогрес — графіки

source: Your progress for
uk: Ваш прогрес за

# progressTooltip
source: Progress
uk: Прогрес

# exerciseLabel
source: Exercise:
uk: Вправа:

source: Choose exercise
uk: Оберіть вправу

# tabMonth
source: Month
uk: Місяць

# tabYear
source: Year
uk: Рік

# noDataRange
source: No data for selected exercise in this range
uk: Немає даних для вибраної вправи у цьому діапазоні

# liftedWeight
source: Lifted volume
uk: Піднятий обсяг

# liftedWeightHelp
source: Volume = Weight × Reps
uk: Обсяг = Вага × Повтори

# liftedWeightDescription
source: Formula description
uk: Опис формули

source: Total lifted:
uk: Всього піднято:

source: Max weight:
uk: Макс. вага:

# pointsCount
source: Points:
uk: Точок:

# settingsTitle
source: Settings
uk: Налаштування

# editProfileTitle
source: Edit Profile
uk: Редагувати профіль

source: Dark Mode
uk: Темний режим

source: Light Mode
uk: Світлий режим

source: Notifications
uk: Сповіщення

source: App Language
uk: Мова додатку

source: Select Language
uk: Виберіть мову

source: About App
uk: Про додаток

# appDescription
source: App for tracking your workouts.
uk: Додаток для відстеження ваших тренувань.

# delPhoto
source: Delete photo
uk: Видалити фото

# deletePhotoTitle
source: Delete photo
uk: Видалити фото

# deletePhotoConfirm
source: Do you really want to delete the photo?
uk: Ви дійсно хочете видалити фото?

# logoutAction
source: Log Out
uk: Вийти

# logoutTitle
source: Log out from profile
uk: Вихід із профілю

# logoutConfirm
source: Do you really want to log out?
uk: Ви дійсно хочете вийти?

# clearData
source: Clear all data
uk: Очистити всі дані

# clearDataConfirmTitle
source: Clear all data
uk: Очистити всі дані

# clearDataConfirmContent
source: This will delete all saved workouts and settings. Continue?
uk: Це видалить усі збережені тренування та налаштування. Продовжити?

# dataClearedSuccess
source: Data cleared successfully
uk: Дані успішно очищені

source: Delete Account
uk: Видалити акаунт

# deleteAccountTitle
source: Delete Account?
uk: Видалити акаунт?

# deleteAccountWarning
source: This action cannot be undone. All your data (workouts, stats, profile) will be permanently lost.
uk: Цю дію неможливо скасувати. Всі ваші дані (тренування, статистика, профіль) будуть втрачені назавжди.

source: Security Update
uk: Вимога безпеки

# reLoginRequiredMsg
source: For security reasons, please Log Out and Log In again before deleting your account.
uk: З міркувань безпеки, будь ласка, вийдіть з акаунту та увійдіть знову перед видаленням.

# exSquat
source: Squat
uk: Присідання

# exLunge
source: Lunge
uk: Випади

# exLegPress
source: Leg Press
uk: Жим ногами

# exWallSit
source: Wall Sit
uk: Вправа біля стіни

# exLegExtension
source: Leg Extension
uk: Розгинання ніг

# exLegCurl
source: Leg Curl
uk: Згинання ніг

# exDeadlift
source: Deadlift
uk: Станова тяга

# exGoodMorning
source: Good Morning
uk: Нахили зі штангою \ "Добрий ранок"

# exStandingCalfRaise
source: Standing Calf Raise
uk: Підйоми на носки стоячи

# exSeatedCalfRaise
source: Seated Calf Raise
uk: Підйоми на носки сидячи

# exPushUp
source: Push-up
uk: Відтискання

# exPullUp
source: Pull-up
uk: Підтягування

# exDip
source: Dip
uk: Віджимання на брусах

# exBenchPress
source: Bench Press
uk: Жим лежачи

# exMachineFly
source: Machine Fly (Pec Deck)
uk: Машинні розведення

# exLateralRaise
source: Lateral Raise
uk: Розведення рук у сторони

# exBentOverRow
source: Bent-Over Row
uk: Тяга в нахилі

# exLatPullDown
source: Lat Pull-Down
uk: Тяга верхнього блока

# exShoulderShrug
source: Shrug
uk: Шраги

# exOverheadPress
source: Overhead Press
uk: Жим над головою

# exFrontRaise
source: Front Raise
uk: Передні підйоми рук

# exRearDeltRaise
source: Rear Delt Raise
uk: Задні розведення дельт

# exBicepsCurl
source: Biceps Curl
uk: Підйоми на біцепс

# exTricepsExtension
source: Overhead Triceps Extension
uk: Французький жим

# exCrunch
source: Crunch
uk: Скручування

# exSitUp
source: Sit-up
uk: Підйом тулуба

# exPlank
source: Plank
uk: Планка

# exLegRaise
source: Leg Raise
uk: Підйоми ніг

# exHyperextension
source: Hyperextension
uk: Гіперекстензія

# exHammerCurl
source: Hammer Curl
uk: Молотковий підйом

# exZottmanCurl
source: Zottman Curl
uk: Сгибания Зоттмана

# exMachineRow
source: Machine Row
uk: Тяга в блоці

# exLegRaiseHang
source: Hanging Leg Raise
uk: Підйоми ніг у висі

source: Finish Workout
uk: Завершити тренування

source: Workout Summary
uk: Підсумок тренування

# durationLabel
source: Duration
uk: Тривалість

# noPreviousData
source: No previous data to compare
uk: Немає даних для порівняння

source: Great Job!
uk: Чудова робота!

source: View Last Report
uk: Останній звіт

# copyLastWorkout
source: Copied from last ${type} workout
uk: Скопійовано з останнього {type} тренування

# comparisonTitle
source: Month comparison
uk: Порівняння за місяць

source: Start Value
uk: Початкове значення

source: Current Value
uk: Поточне значення

source: Difference
uk: Різниця

# notificationsEnabledTitle
source: Notifications Enabled! 🔔
uk: Сповіщення увімкнено! 🔔

# notificationsEnabledBody
source: You will now receive reminders.
uk: Тепер ви будете отримувати нагадування.

# healthTitle
source: Health
uk: Здоровʼя

# weightChangeLabel
source: Weight Change
uk: Зміна ваги

source: Gym Sessions
uk: Сесії в залі

source: Reminder Settings
uk: Налаштування нагадувань

source: Frequency
uk: Частота

source: Daily
uk: Щодня

source: Weekly
uk: Щотижня

source: Select Time
uk: Оберіть час

# reminderSet
source: Reminder set for: {time}
uk: Нагадування встановлено: {time}

source: Edit Weight
uk: Редагувати вагу

source: Add Weight
uk: Додати вагу

# weightDateRange
source: Change from {start} to {end}
uk: Зміна з {start} по {end}

source: Save Settings
uk: Зберегти налаштування

source: History
uk: Історія

source: Weight History
uk: Історія ваги
